MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFR32BG1B132F256GM48/mcu.h
/* If part number is not defined as compiler option, define it */
#if !defined(EFR32BG1B132F256GM48)
#define EFR32BG1B132F256GM48    1 /**< BLUE Gecko Part */
#endif

/** Configure part number */
#define PART_NUMBER               "EFR32BG1B132F256GM48" /**< Part Number */

/** Memory Base addresses and limits */
#define CRYPTO_MEM_BASE           (0x400F0000UL) /**< CRYPTO base address  */
#define CRYPTO_MEM_SIZE           (0x400UL)      /**< CRYPTO available address space  */
#define CRYPTO_MEM_END            (0x400F03FFUL) /**< CRYPTO end address  */
#define CRYPTO_MEM_BITS           (0x0000000AUL) /**< CRYPTO used bits  */
#define RAM_MEM_BASE              (0x20000000UL) /**< RAM base address  */
#define RAM_MEM_SIZE              (0x7C00UL)     /**< RAM available address space  */
#define RAM_MEM_END               (0x20007BFFUL) /**< RAM end address  */
#define RAM_MEM_BITS              (0x0000000FUL) /**< RAM used bits  */
#define PER_BITSET_MEM_BASE       (0x46000000UL) /**< PER_BITSET base address  */
#define PER_BITSET_MEM_SIZE       (0xE8000UL)    /**< PER_BITSET available address space  */
#define PER_BITSET_MEM_END        (0x460E7FFFUL) /**< PER_BITSET end address  */
#define PER_BITSET_MEM_BITS       (0x00000014UL) /**< PER_BITSET used bits  */
#define CRYPTO_BITSET_MEM_BASE    (0x460F0000UL) /**< CRYPTO_BITSET base address  */
#define CRYPTO_BITSET_MEM_SIZE    (0x400UL)      /**< CRYPTO_BITSET available address space  */
#define CRYPTO_BITSET_MEM_END     (0x460F03FFUL) /**< CRYPTO_BITSET end address  */
#define CRYPTO_BITSET_MEM_BITS    (0x0000000AUL) /**< CRYPTO_BITSET used bits  */
#define PER_MEM_BASE              (0x40000000UL) /**< PER base address  */
#define PER_MEM_SIZE              (0xE8000UL)    /**< PER available address space  */
#define PER_MEM_END               (0x400E7FFFUL) /**< PER end address  */
#define PER_MEM_BITS              (0x00000014UL) /**< PER used bits  */
#define CRYPTO_BITCLR_MEM_BASE    (0x440F0000UL) /**< CRYPTO_BITCLR base address  */
#define CRYPTO_BITCLR_MEM_SIZE    (0x400UL)      /**< CRYPTO_BITCLR available address space  */
#define CRYPTO_BITCLR_MEM_END     (0x440F03FFUL) /**< CRYPTO_BITCLR end address  */
#define CRYPTO_BITCLR_MEM_BITS    (0x0000000AUL) /**< CRYPTO_BITCLR used bits  */
#define RAM_CODE_MEM_BASE         (0x10000000UL) /**< RAM_CODE base address  */
#define RAM_CODE_MEM_SIZE         (0x7C00UL)     /**< RAM_CODE available address space  */
#define RAM_CODE_MEM_END          (0x10007BFFUL) /**< RAM_CODE end address  */
#define RAM_CODE_MEM_BITS         (0x0000000FUL) /**< RAM_CODE used bits  */
#define FLASH_MEM_BASE            (0x00000000UL) /**< FLASH base address  */
#define FLASH_MEM_SIZE            (0x10000000UL) /**< FLASH available address space  */
#define FLASH_MEM_END             (0x0FFFFFFFUL) /**< FLASH end address  */
#define FLASH_MEM_BITS            (0x0000001CUL) /**< FLASH used bits  */
#define PER_BITCLR_MEM_BASE       (0x44000000UL) /**< PER_BITCLR base address  */
#define PER_BITCLR_MEM_SIZE       (0xE8000UL)    /**< PER_BITCLR available address space  */
#define PER_BITCLR_MEM_END        (0x440E7FFFUL) /**< PER_BITCLR end address  */
#define PER_BITCLR_MEM_BITS       (0x00000014UL) /**< PER_BITCLR used bits  */

/** Bit banding area */
#define BITBAND_PER_BASE          (0x42000000UL) /**< Peripheral Address Space bit-band area */
#define BITBAND_RAM_BASE          (0x22000000UL) /**< SRAM Address Space bit-band area */

/** Flash and SRAM limits for EFR32BG1B132F256GM48 */
#define FLASH_BASE                (0x00000000UL) /**< Flash Base Address */
#define FLASH_SIZE                (0x00040000UL) /**< Available Flash Memory */
#define FLASH_PAGE_SIZE           2048U          /**< Flash Memory page size */
#define SRAM_BASE                 (0x20000000UL) /**< SRAM Base Address */
#define SRAM_SIZE                 (0x00007C00UL) /**< Available SRAM Memory */
#define __CM4_REV                 0x0001U        /**< Cortex-M4 Core revision r0p1 */
#define PRS_CHAN_COUNT            12             /**< Number of PRS channels */
#define DMA_CHAN_COUNT            8              /**< Number of DMA channels */
#define EXT_IRQ_COUNT             34             /**< Number of External (NVIC) interrupts */

/** AF channels connect the different on-chip peripherals with the af-mux */
#define AFCHAN_MAX                72U
/** AF channel maximum location number */
#define AFCHANLOC_MAX             32U
/** Analog AF channels */
#define AFACHAN_MAX               61U

/* Part number capabilities */

#define TIMER_PRESENT           /**< TIMER is available in this part */
#define TIMER_COUNT           2 /**< 2 TIMERs available  */
#define USART_PRESENT           /**< USART is available in this part */
#define USART_COUNT           2 /**< 2 USARTs available  */
#define LEUART_PRESENT          /**< LEUART is available in this part */
#define LEUART_COUNT          1 /**< 1 LEUARTs available  */
#define LETIMER_PRESENT         /**< LETIMER is available in this part */
#define LETIMER_COUNT         1 /**< 1 LETIMERs available  */
#define PCNT_PRESENT            /**< PCNT is available in this part */
#define PCNT_COUNT            1 /**< 1 PCNTs available  */
#define I2C_PRESENT             /**< I2C is available in this part */
#define I2C_COUNT             1 /**< 1 I2Cs available  */
#define ADC_PRESENT             /**< ADC is available in this part */
#define ADC_COUNT             1 /**< 1 ADCs available  */
#define ACMP_PRESENT            /**< ACMP is available in this part */
#define ACMP_COUNT            2 /**< 2 ACMPs available  */
#define IDAC_PRESENT            /**< IDAC is available in this part */
#define IDAC_COUNT            1 /**< 1 IDACs available  */
#define WDOG_PRESENT            /**< WDOG is available in this part */
#define WDOG_COUNT            1 /**< 1 WDOGs available  */
#define MSC_PRESENT             /**< MSC is available in this part */
#define MSC_COUNT             1 /**< 1 MSC available */
#define EMU_PRESENT             /**< EMU is available in this part */
#define EMU_COUNT             1 /**< 1 EMU available */
#define RMU_PRESENT             /**< RMU is available in this part */
#define RMU_COUNT             1 /**< 1 RMU available */
#define CMU_PRESENT             /**< CMU is available in this part */
#define CMU_COUNT             1 /**< 1 CMU available */
#define CRYPTO_PRESENT          /**< CRYPTO is available in this part */
#define CRYPTO_COUNT          1 /**< 1 CRYPTO available */
#define GPIO_PRESENT            /**< GPIO is available in this part */
#define GPIO_COUNT            1 /**< 1 GPIO available */
#define PRS_PRESENT             /**< PRS is available in this part */
#define PRS_COUNT             1 /**< 1 PRS available */
#define LDMA_PRESENT            /**< LDMA is available in this part */
#define LDMA_COUNT            1 /**< 1 LDMA available */
#define FPUEH_PRESENT           /**< FPUEH is available in this part */
#define FPUEH_COUNT           1 /**< 1 FPUEH available */
#define GPCRC_PRESENT           /**< GPCRC is available in this part */
#define GPCRC_COUNT           1 /**< 1 GPCRC available */
#define CRYOTIMER_PRESENT       /**< CRYOTIMER is available in this part */
#define CRYOTIMER_COUNT       1 /**< 1 CRYOTIMER available */
#define RTCC_PRESENT            /**< RTCC is available in this part */
#define RTCC_COUNT            1 /**< 1 RTCC available */
#define BOOTLOADER_PRESENT      /**< BOOTLOADER is available in this part */
#define BOOTLOADER_COUNT      1 /**< 1 BOOTLOADER available */
#define DCDC_PRESENT            /**< DCDC is available in this part */
#define DCDC_COUNT            1 /**< 1 DCDC available */

// #include "core_cm4.h"           /* Cortex-M4 processor and core peripherals */  // Note: Changed for MikroE implementation.
// #include "system_efr32bg1b.h"   /* System Header File */  // Note: Changed for MikroE implementation.
#include <stdint.h>
#define     __I     volatile const       /*!< Defines 'read only' permissions */
#define     __O     volatile             /*!< Defines 'write only' permissions */
#define     __IO    volatile             /*!< Defines 'read / write' permissions */

/* following defines should be used for structure members */
#define     __IM     volatile const      /*! Defines 'read only' structure member permissions */
#define     __OM     volatile            /*! Defines 'write only' structure member permissions */
#define     __IOM    volatile            /*! Defines 'read / write' structure member permissions */

